weifengdq/embedded/tc364/tc364_can_x8_gcc/Libraries/Infra/Sfr/TC36x/IfxEray_bf.h
/** \brief Length for Ifx_ERAY_CUST3_Bits.TO */
#define IFX_ERAY_CUST3_TO_LEN (32u)

/** \brief Mask for Ifx_ERAY_CUST3_Bits.TO */
#define IFX_ERAY_CUST3_TO_MSK (0xffffffffu)

/** \brief Offset for Ifx_ERAY_CUST3_Bits.TO */
#define IFX_ERAY_CUST3_TO_OFF (0u)

/** \brief Length for Ifx_ERAY_TEST1_Bits.WRTEN */
#define IFX_ERAY_TEST1_WRTEN_LEN (1u)

/** \brief Mask for Ifx_ERAY_TEST1_Bits.WRTEN */
#define IFX_ERAY_TEST1_WRTEN_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_TEST1_Bits.WRTEN */
#define IFX_ERAY_TEST1_WRTEN_OFF (0u)

/** \brief Length for Ifx_ERAY_TEST1_Bits.ELBE */
#define IFX_ERAY_TEST1_ELBE_LEN (1u)

/** \brief Mask for Ifx_ERAY_TEST1_Bits.ELBE */
#define IFX_ERAY_TEST1_ELBE_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_TEST1_Bits.ELBE */
#define IFX_ERAY_TEST1_ELBE_OFF (1u)

/** \brief Length for Ifx_ERAY_TEST1_Bits.TMC */
#define IFX_ERAY_TEST1_TMC_LEN (2u)

/** \brief Mask for Ifx_ERAY_TEST1_Bits.TMC */
#define IFX_ERAY_TEST1_TMC_MSK (0x3u)

/** \brief Offset for Ifx_ERAY_TEST1_Bits.TMC */
#define IFX_ERAY_TEST1_TMC_OFF (4u)

/** \brief Length for Ifx_ERAY_TEST1_Bits.AOA */
#define IFX_ERAY_TEST1_AOA_LEN (1u)

/** \brief Mask for Ifx_ERAY_TEST1_Bits.AOA */
#define IFX_ERAY_TEST1_AOA_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_TEST1_Bits.AOA */
#define IFX_ERAY_TEST1_AOA_OFF (8u)

/** \brief Length for Ifx_ERAY_TEST1_Bits.AOB */
#define IFX_ERAY_TEST1_AOB_LEN (1u)

/** \brief Mask for Ifx_ERAY_TEST1_Bits.AOB */
#define IFX_ERAY_TEST1_AOB_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_TEST1_Bits.AOB */
#define IFX_ERAY_TEST1_AOB_OFF (9u)

/** \brief Length for Ifx_ERAY_TEST1_Bits.RXA */
#define IFX_ERAY_TEST1_RXA_LEN (1u)

/** \brief Mask for Ifx_ERAY_TEST1_Bits.RXA */
#define IFX_ERAY_TEST1_RXA_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_TEST1_Bits.RXA */
#define IFX_ERAY_TEST1_RXA_OFF (16u)

/** \brief Length for Ifx_ERAY_TEST1_Bits.RXB */
#define IFX_ERAY_TEST1_RXB_LEN (1u)

/** \brief Mask for Ifx_ERAY_TEST1_Bits.RXB */
#define IFX_ERAY_TEST1_RXB_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_TEST1_Bits.RXB */
#define IFX_ERAY_TEST1_RXB_OFF (17u)

/** \brief Length for Ifx_ERAY_TEST1_Bits.TXA */
#define IFX_ERAY_TEST1_TXA_LEN (1u)

/** \brief Mask for Ifx_ERAY_TEST1_Bits.TXA */
#define IFX_ERAY_TEST1_TXA_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_TEST1_Bits.TXA */
#define IFX_ERAY_TEST1_TXA_OFF (18u)

/** \brief Length for Ifx_ERAY_TEST1_Bits.TXB */
#define IFX_ERAY_TEST1_TXB_LEN (1u)

/** \brief Mask for Ifx_ERAY_TEST1_Bits.TXB */
#define IFX_ERAY_TEST1_TXB_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_TEST1_Bits.TXB */
#define IFX_ERAY_TEST1_TXB_OFF (19u)

/** \brief Length for Ifx_ERAY_TEST1_Bits.TXENA */
#define IFX_ERAY_TEST1_TXENA_LEN (1u)

/** \brief Mask for Ifx_ERAY_TEST1_Bits.TXENA */
#define IFX_ERAY_TEST1_TXENA_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_TEST1_Bits.TXENA */
#define IFX_ERAY_TEST1_TXENA_OFF (20u)

/** \brief Length for Ifx_ERAY_TEST1_Bits.TXENB */
#define IFX_ERAY_TEST1_TXENB_LEN (1u)

/** \brief Mask for Ifx_ERAY_TEST1_Bits.TXENB */
#define IFX_ERAY_TEST1_TXENB_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_TEST1_Bits.TXENB */
#define IFX_ERAY_TEST1_TXENB_OFF (21u)

/** \brief Length for Ifx_ERAY_TEST1_Bits.CERA */
#define IFX_ERAY_TEST1_CERA_LEN (4u)

/** \brief Mask for Ifx_ERAY_TEST1_Bits.CERA */
#define IFX_ERAY_TEST1_CERA_MSK (0xfu)

/** \brief Offset for Ifx_ERAY_TEST1_Bits.CERA */
#define IFX_ERAY_TEST1_CERA_OFF (24u)

/** \brief Length for Ifx_ERAY_TEST1_Bits.CERB */
#define IFX_ERAY_TEST1_CERB_LEN (4u)

/** \brief Mask for Ifx_ERAY_TEST1_Bits.CERB */
#define IFX_ERAY_TEST1_CERB_MSK (0xfu)

/** \brief Offset for Ifx_ERAY_TEST1_Bits.CERB */
#define IFX_ERAY_TEST1_CERB_OFF (28u)

/** \brief Length for Ifx_ERAY_TEST2_Bits.RS */
#define IFX_ERAY_TEST2_RS_LEN (3u)

/** \brief Mask for Ifx_ERAY_TEST2_Bits.RS */
#define IFX_ERAY_TEST2_RS_MSK (0x7u)

/** \brief Offset for Ifx_ERAY_TEST2_Bits.RS */
#define IFX_ERAY_TEST2_RS_OFF (0u)

/** \brief Length for Ifx_ERAY_TEST2_Bits.SSEL */
#define IFX_ERAY_TEST2_SSEL_LEN (3u)

/** \brief Mask for Ifx_ERAY_TEST2_Bits.SSEL */
#define IFX_ERAY_TEST2_SSEL_MSK (0x7u)

/** \brief Offset for Ifx_ERAY_TEST2_Bits.SSEL */
#define IFX_ERAY_TEST2_SSEL_OFF (4u)

/** \brief Length for Ifx_ERAY_TEST2_Bits.WRECC */
#define IFX_ERAY_TEST2_WRECC_LEN (1u)

/** \brief Mask for Ifx_ERAY_TEST2_Bits.WRECC */
#define IFX_ERAY_TEST2_WRECC_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_TEST2_Bits.WRECC */
#define IFX_ERAY_TEST2_WRECC_OFF (14u)

/** \brief Length for Ifx_ERAY_LCK_Bits.CLK */
#define IFX_ERAY_LCK_CLK_LEN (8u)

/** \brief Mask for Ifx_ERAY_LCK_Bits.CLK */
#define IFX_ERAY_LCK_CLK_MSK (0xffu)

/** \brief Offset for Ifx_ERAY_LCK_Bits.CLK */
#define IFX_ERAY_LCK_CLK_OFF (0u)

/** \brief Length for Ifx_ERAY_LCK_Bits.TMK */
#define IFX_ERAY_LCK_TMK_LEN (8u)

/** \brief Mask for Ifx_ERAY_LCK_Bits.TMK */
#define IFX_ERAY_LCK_TMK_MSK (0xffu)

/** \brief Offset for Ifx_ERAY_LCK_Bits.TMK */
#define IFX_ERAY_LCK_TMK_OFF (8u)

/** \brief Length for Ifx_ERAY_EIR_Bits.PEMC */
#define IFX_ERAY_EIR_PEMC_LEN (1u)

/** \brief Mask for Ifx_ERAY_EIR_Bits.PEMC */
#define IFX_ERAY_EIR_PEMC_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_EIR_Bits.PEMC */
#define IFX_ERAY_EIR_PEMC_OFF (0u)

/** \brief Length for Ifx_ERAY_EIR_Bits.CNA */
#define IFX_ERAY_EIR_CNA_LEN (1u)

/** \brief Mask for Ifx_ERAY_EIR_Bits.CNA */
#define IFX_ERAY_EIR_CNA_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_EIR_Bits.CNA */
#define IFX_ERAY_EIR_CNA_OFF (1u)

/** \brief Length for Ifx_ERAY_EIR_Bits.SFBM */
#define IFX_ERAY_EIR_SFBM_LEN (1u)

/** \brief Mask for Ifx_ERAY_EIR_Bits.SFBM */
#define IFX_ERAY_EIR_SFBM_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_EIR_Bits.SFBM */
#define IFX_ERAY_EIR_SFBM_OFF (2u)

/** \brief Length for Ifx_ERAY_EIR_Bits.SFO */
#define IFX_ERAY_EIR_SFO_LEN (1u)

/** \brief Mask for Ifx_ERAY_EIR_Bits.SFO */
#define IFX_ERAY_EIR_SFO_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_EIR_Bits.SFO */
#define IFX_ERAY_EIR_SFO_OFF (3u)

/** \brief Length for Ifx_ERAY_EIR_Bits.CCF */
#define IFX_ERAY_EIR_CCF_LEN (1u)

/** \brief Mask for Ifx_ERAY_EIR_Bits.CCF */
#define IFX_ERAY_EIR_CCF_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_EIR_Bits.CCF */
#define IFX_ERAY_EIR_CCF_OFF (4u)

/** \brief Length for Ifx_ERAY_EIR_Bits.CCL */
#define IFX_ERAY_EIR_CCL_LEN (1u)

/** \brief Mask for Ifx_ERAY_EIR_Bits.CCL */
#define IFX_ERAY_EIR_CCL_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_EIR_Bits.CCL */
#define IFX_ERAY_EIR_CCL_OFF (5u)

/** \brief Length for Ifx_ERAY_EIR_Bits.EERR */
#define IFX_ERAY_EIR_EERR_LEN (1u)

/** \brief Mask for Ifx_ERAY_EIR_Bits.EERR */
#define IFX_ERAY_EIR_EERR_MSK (0x1u)

