weifengdq/embedded/tc364/tc364_can_x8_gcc/Libraries/Infra/Sfr/TC36x/IfxEray_bf.h
/** \brief Mask for Ifx_ERAY_SIER_Bits.WUPBE */
#define IFX_ERAY_SIER_WUPBE_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_SIER_Bits.WUPBE */
#define IFX_ERAY_SIER_WUPBE_OFF (24u)

/** \brief Length for Ifx_ERAY_SIER_Bits.MTSBE */
#define IFX_ERAY_SIER_MTSBE_LEN (1u)

/** \brief Mask for Ifx_ERAY_SIER_Bits.MTSBE */
#define IFX_ERAY_SIER_MTSBE_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_SIER_Bits.MTSBE */
#define IFX_ERAY_SIER_MTSBE_OFF (25u)

/** \brief Length for Ifx_ERAY_ILE_Bits.EINT0 */
#define IFX_ERAY_ILE_EINT0_LEN (1u)

/** \brief Mask for Ifx_ERAY_ILE_Bits.EINT0 */
#define IFX_ERAY_ILE_EINT0_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_ILE_Bits.EINT0 */
#define IFX_ERAY_ILE_EINT0_OFF (0u)

/** \brief Length for Ifx_ERAY_ILE_Bits.EINT1 */
#define IFX_ERAY_ILE_EINT1_LEN (1u)

/** \brief Mask for Ifx_ERAY_ILE_Bits.EINT1 */
#define IFX_ERAY_ILE_EINT1_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_ILE_Bits.EINT1 */
#define IFX_ERAY_ILE_EINT1_OFF (1u)

/** \brief Length for Ifx_ERAY_T0C_Bits.T0RC */
#define IFX_ERAY_T0C_T0RC_LEN (1u)

/** \brief Mask for Ifx_ERAY_T0C_Bits.T0RC */
#define IFX_ERAY_T0C_T0RC_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_T0C_Bits.T0RC */
#define IFX_ERAY_T0C_T0RC_OFF (0u)

/** \brief Length for Ifx_ERAY_T0C_Bits.T0MS */
#define IFX_ERAY_T0C_T0MS_LEN (1u)

/** \brief Mask for Ifx_ERAY_T0C_Bits.T0MS */
#define IFX_ERAY_T0C_T0MS_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_T0C_Bits.T0MS */
#define IFX_ERAY_T0C_T0MS_OFF (1u)

/** \brief Length for Ifx_ERAY_T0C_Bits.T0CC */
#define IFX_ERAY_T0C_T0CC_LEN (7u)

/** \brief Mask for Ifx_ERAY_T0C_Bits.T0CC */
#define IFX_ERAY_T0C_T0CC_MSK (0x7fu)

/** \brief Offset for Ifx_ERAY_T0C_Bits.T0CC */
#define IFX_ERAY_T0C_T0CC_OFF (8u)

/** \brief Length for Ifx_ERAY_T0C_Bits.T0MO */
#define IFX_ERAY_T0C_T0MO_LEN (14u)

/** \brief Mask for Ifx_ERAY_T0C_Bits.T0MO */
#define IFX_ERAY_T0C_T0MO_MSK (0x3fffu)

/** \brief Offset for Ifx_ERAY_T0C_Bits.T0MO */
#define IFX_ERAY_T0C_T0MO_OFF (16u)

/** \brief Length for Ifx_ERAY_T1C_Bits.T1RC */
#define IFX_ERAY_T1C_T1RC_LEN (1u)

/** \brief Mask for Ifx_ERAY_T1C_Bits.T1RC */
#define IFX_ERAY_T1C_T1RC_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_T1C_Bits.T1RC */
#define IFX_ERAY_T1C_T1RC_OFF (0u)

/** \brief Length for Ifx_ERAY_T1C_Bits.T1MS */
#define IFX_ERAY_T1C_T1MS_LEN (1u)

/** \brief Mask for Ifx_ERAY_T1C_Bits.T1MS */
#define IFX_ERAY_T1C_T1MS_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_T1C_Bits.T1MS */
#define IFX_ERAY_T1C_T1MS_OFF (1u)

/** \brief Length for Ifx_ERAY_T1C_Bits.T1MC */
#define IFX_ERAY_T1C_T1MC_LEN (14u)

/** \brief Mask for Ifx_ERAY_T1C_Bits.T1MC */
#define IFX_ERAY_T1C_T1MC_MSK (0x3fffu)

/** \brief Offset for Ifx_ERAY_T1C_Bits.T1MC */
#define IFX_ERAY_T1C_T1MC_OFF (16u)

/** \brief Length for Ifx_ERAY_STPW1_Bits.ESWT */
#define IFX_ERAY_STPW1_ESWT_LEN (1u)

/** \brief Mask for Ifx_ERAY_STPW1_Bits.ESWT */
#define IFX_ERAY_STPW1_ESWT_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_STPW1_Bits.ESWT */
#define IFX_ERAY_STPW1_ESWT_OFF (0u)

/** \brief Length for Ifx_ERAY_STPW1_Bits.SWMS */
#define IFX_ERAY_STPW1_SWMS_LEN (1u)

/** \brief Mask for Ifx_ERAY_STPW1_Bits.SWMS */
#define IFX_ERAY_STPW1_SWMS_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_STPW1_Bits.SWMS */
#define IFX_ERAY_STPW1_SWMS_OFF (1u)

/** \brief Length for Ifx_ERAY_STPW1_Bits.EDGE */
#define IFX_ERAY_STPW1_EDGE_LEN (1u)

/** \brief Mask for Ifx_ERAY_STPW1_Bits.EDGE */
#define IFX_ERAY_STPW1_EDGE_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_STPW1_Bits.EDGE */
#define IFX_ERAY_STPW1_EDGE_OFF (2u)

/** \brief Length for Ifx_ERAY_STPW1_Bits.SSWT */
#define IFX_ERAY_STPW1_SSWT_LEN (1u)

/** \brief Mask for Ifx_ERAY_STPW1_Bits.SSWT */
#define IFX_ERAY_STPW1_SSWT_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_STPW1_Bits.SSWT */
#define IFX_ERAY_STPW1_SSWT_OFF (3u)

/** \brief Length for Ifx_ERAY_STPW1_Bits.EETP */
#define IFX_ERAY_STPW1_EETP_LEN (1u)

/** \brief Mask for Ifx_ERAY_STPW1_Bits.EETP */
#define IFX_ERAY_STPW1_EETP_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_STPW1_Bits.EETP */
#define IFX_ERAY_STPW1_EETP_OFF (4u)

/** \brief Length for Ifx_ERAY_STPW1_Bits.EINT0 */
#define IFX_ERAY_STPW1_EINT0_LEN (1u)

/** \brief Mask for Ifx_ERAY_STPW1_Bits.EINT0 */
#define IFX_ERAY_STPW1_EINT0_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_STPW1_Bits.EINT0 */
#define IFX_ERAY_STPW1_EINT0_OFF (5u)

/** \brief Length for Ifx_ERAY_STPW1_Bits.EINT1 */
#define IFX_ERAY_STPW1_EINT1_LEN (1u)

/** \brief Mask for Ifx_ERAY_STPW1_Bits.EINT1 */
#define IFX_ERAY_STPW1_EINT1_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_STPW1_Bits.EINT1 */
#define IFX_ERAY_STPW1_EINT1_OFF (6u)

/** \brief Length for Ifx_ERAY_STPW1_Bits.SCCV */
#define IFX_ERAY_STPW1_SCCV_LEN (6u)

/** \brief Mask for Ifx_ERAY_STPW1_Bits.SCCV */
#define IFX_ERAY_STPW1_SCCV_MSK (0x3fu)

/** \brief Offset for Ifx_ERAY_STPW1_Bits.SCCV */
#define IFX_ERAY_STPW1_SCCV_OFF (8u)

/** \brief Length for Ifx_ERAY_STPW1_Bits.SMTV */
#define IFX_ERAY_STPW1_SMTV_LEN (14u)

/** \brief Mask for Ifx_ERAY_STPW1_Bits.SMTV */
#define IFX_ERAY_STPW1_SMTV_MSK (0x3fffu)

/** \brief Offset for Ifx_ERAY_STPW1_Bits.SMTV */
#define IFX_ERAY_STPW1_SMTV_OFF (16u)

/** \brief Length for Ifx_ERAY_STPW2_Bits.SSCVA */
#define IFX_ERAY_STPW2_SSCVA_LEN (11u)

/** \brief Mask for Ifx_ERAY_STPW2_Bits.SSCVA */
#define IFX_ERAY_STPW2_SSCVA_MSK (0x7ffu)

/** \brief Offset for Ifx_ERAY_STPW2_Bits.SSCVA */
#define IFX_ERAY_STPW2_SSCVA_OFF (0u)

/** \brief Length for Ifx_ERAY_STPW2_Bits.SSCVB */
#define IFX_ERAY_STPW2_SSCVB_LEN (11u)

/** \brief Mask for Ifx_ERAY_STPW2_Bits.SSCVB */
#define IFX_ERAY_STPW2_SSCVB_MSK (0x7ffu)

/** \brief Offset for Ifx_ERAY_STPW2_Bits.SSCVB */
#define IFX_ERAY_STPW2_SSCVB_OFF (16u)

/** \brief Length for Ifx_ERAY_SUCC1_Bits.CMD */
#define IFX_ERAY_SUCC1_CMD_LEN (4u)

/** \brief Mask for Ifx_ERAY_SUCC1_Bits.CMD */
#define IFX_ERAY_SUCC1_CMD_MSK (0xfu)

/** \brief Offset for Ifx_ERAY_SUCC1_Bits.CMD */
#define IFX_ERAY_SUCC1_CMD_OFF (0u)

/** \brief Length for Ifx_ERAY_SUCC1_Bits.PBSY */
#define IFX_ERAY_SUCC1_PBSY_LEN (1u)

/** \brief Mask for Ifx_ERAY_SUCC1_Bits.PBSY */
#define IFX_ERAY_SUCC1_PBSY_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_SUCC1_Bits.PBSY */
#define IFX_ERAY_SUCC1_PBSY_OFF (7u)

