weifengdq/embedded/tc364/tc364_can_x8_gcc/Libraries/Infra/Sfr/TC36x/IfxEray_bf.h
/** \brief Mask for Ifx_ERAY_MSIC3_Bits.MSIP75 */
#define IFX_ERAY_MSIC3_MSIP75_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_MSIC3_Bits.MSIP75 */
#define IFX_ERAY_MSIC3_MSIP75_OFF (11u)

/** \brief Length for Ifx_ERAY_MSIC3_Bits.MSIP76 */
#define IFX_ERAY_MSIC3_MSIP76_LEN (1u)

/** \brief Mask for Ifx_ERAY_MSIC3_Bits.MSIP76 */
#define IFX_ERAY_MSIC3_MSIP76_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_MSIC3_Bits.MSIP76 */
#define IFX_ERAY_MSIC3_MSIP76_OFF (12u)

/** \brief Length for Ifx_ERAY_MSIC3_Bits.MSIP77 */
#define IFX_ERAY_MSIC3_MSIP77_LEN (1u)

/** \brief Mask for Ifx_ERAY_MSIC3_Bits.MSIP77 */
#define IFX_ERAY_MSIC3_MSIP77_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_MSIC3_Bits.MSIP77 */
#define IFX_ERAY_MSIC3_MSIP77_OFF (13u)

/** \brief Length for Ifx_ERAY_MSIC3_Bits.MSIP78 */
#define IFX_ERAY_MSIC3_MSIP78_LEN (1u)

/** \brief Mask for Ifx_ERAY_MSIC3_Bits.MSIP78 */
#define IFX_ERAY_MSIC3_MSIP78_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_MSIC3_Bits.MSIP78 */
#define IFX_ERAY_MSIC3_MSIP78_OFF (14u)

/** \brief Length for Ifx_ERAY_MSIC3_Bits.MSIP79 */
#define IFX_ERAY_MSIC3_MSIP79_LEN (1u)

/** \brief Mask for Ifx_ERAY_MSIC3_Bits.MSIP79 */
#define IFX_ERAY_MSIC3_MSIP79_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_MSIC3_Bits.MSIP79 */
#define IFX_ERAY_MSIC3_MSIP79_OFF (15u)

/** \brief Length for Ifx_ERAY_MSIC3_Bits.MSIP80 */
#define IFX_ERAY_MSIC3_MSIP80_LEN (1u)

/** \brief Mask for Ifx_ERAY_MSIC3_Bits.MSIP80 */
#define IFX_ERAY_MSIC3_MSIP80_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_MSIC3_Bits.MSIP80 */
#define IFX_ERAY_MSIC3_MSIP80_OFF (16u)

/** \brief Length for Ifx_ERAY_MSIC3_Bits.MSIP81 */
#define IFX_ERAY_MSIC3_MSIP81_LEN (1u)

/** \brief Mask for Ifx_ERAY_MSIC3_Bits.MSIP81 */
#define IFX_ERAY_MSIC3_MSIP81_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_MSIC3_Bits.MSIP81 */
#define IFX_ERAY_MSIC3_MSIP81_OFF (17u)

/** \brief Length for Ifx_ERAY_MSIC3_Bits.MSIP82 */
#define IFX_ERAY_MSIC3_MSIP82_LEN (1u)

/** \brief Mask for Ifx_ERAY_MSIC3_Bits.MSIP82 */
#define IFX_ERAY_MSIC3_MSIP82_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_MSIC3_Bits.MSIP82 */
#define IFX_ERAY_MSIC3_MSIP82_OFF (18u)

/** \brief Length for Ifx_ERAY_MSIC3_Bits.MSIP83 */
#define IFX_ERAY_MSIC3_MSIP83_LEN (1u)

/** \brief Mask for Ifx_ERAY_MSIC3_Bits.MSIP83 */
#define IFX_ERAY_MSIC3_MSIP83_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_MSIC3_Bits.MSIP83 */
#define IFX_ERAY_MSIC3_MSIP83_OFF (19u)

/** \brief Length for Ifx_ERAY_MSIC3_Bits.MSIP84 */
#define IFX_ERAY_MSIC3_MSIP84_LEN (1u)

/** \brief Mask for Ifx_ERAY_MSIC3_Bits.MSIP84 */
#define IFX_ERAY_MSIC3_MSIP84_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_MSIC3_Bits.MSIP84 */
#define IFX_ERAY_MSIC3_MSIP84_OFF (20u)

/** \brief Length for Ifx_ERAY_MSIC3_Bits.MSIP85 */
#define IFX_ERAY_MSIC3_MSIP85_LEN (1u)

/** \brief Mask for Ifx_ERAY_MSIC3_Bits.MSIP85 */
#define IFX_ERAY_MSIC3_MSIP85_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_MSIC3_Bits.MSIP85 */
#define IFX_ERAY_MSIC3_MSIP85_OFF (21u)

/** \brief Length for Ifx_ERAY_MSIC3_Bits.MSIP86 */
#define IFX_ERAY_MSIC3_MSIP86_LEN (1u)

/** \brief Mask for Ifx_ERAY_MSIC3_Bits.MSIP86 */
#define IFX_ERAY_MSIC3_MSIP86_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_MSIC3_Bits.MSIP86 */
#define IFX_ERAY_MSIC3_MSIP86_OFF (22u)

/** \brief Length for Ifx_ERAY_MSIC3_Bits.MSIP87 */
#define IFX_ERAY_MSIC3_MSIP87_LEN (1u)

/** \brief Mask for Ifx_ERAY_MSIC3_Bits.MSIP87 */
#define IFX_ERAY_MSIC3_MSIP87_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_MSIC3_Bits.MSIP87 */
#define IFX_ERAY_MSIC3_MSIP87_OFF (23u)

/** \brief Length for Ifx_ERAY_MSIC3_Bits.MSIP88 */
#define IFX_ERAY_MSIC3_MSIP88_LEN (1u)

/** \brief Mask for Ifx_ERAY_MSIC3_Bits.MSIP88 */
#define IFX_ERAY_MSIC3_MSIP88_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_MSIC3_Bits.MSIP88 */
#define IFX_ERAY_MSIC3_MSIP88_OFF (24u)

/** \brief Length for Ifx_ERAY_MSIC3_Bits.MSIP89 */
#define IFX_ERAY_MSIC3_MSIP89_LEN (1u)

/** \brief Mask for Ifx_ERAY_MSIC3_Bits.MSIP89 */
#define IFX_ERAY_MSIC3_MSIP89_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_MSIC3_Bits.MSIP89 */
#define IFX_ERAY_MSIC3_MSIP89_OFF (25u)

/** \brief Length for Ifx_ERAY_MSIC3_Bits.MSIP90 */
#define IFX_ERAY_MSIC3_MSIP90_LEN (1u)

/** \brief Mask for Ifx_ERAY_MSIC3_Bits.MSIP90 */
#define IFX_ERAY_MSIC3_MSIP90_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_MSIC3_Bits.MSIP90 */
#define IFX_ERAY_MSIC3_MSIP90_OFF (26u)

/** \brief Length for Ifx_ERAY_MSIC3_Bits.MSIP91 */
#define IFX_ERAY_MSIC3_MSIP91_LEN (1u)

/** \brief Mask for Ifx_ERAY_MSIC3_Bits.MSIP91 */
#define IFX_ERAY_MSIC3_MSIP91_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_MSIC3_Bits.MSIP91 */
#define IFX_ERAY_MSIC3_MSIP91_OFF (27u)

/** \brief Length for Ifx_ERAY_MSIC3_Bits.MSIP92 */
#define IFX_ERAY_MSIC3_MSIP92_LEN (1u)

/** \brief Mask for Ifx_ERAY_MSIC3_Bits.MSIP92 */
#define IFX_ERAY_MSIC3_MSIP92_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_MSIC3_Bits.MSIP92 */
#define IFX_ERAY_MSIC3_MSIP92_OFF (28u)

/** \brief Length for Ifx_ERAY_MSIC3_Bits.MSIP93 */
#define IFX_ERAY_MSIC3_MSIP93_LEN (1u)

/** \brief Mask for Ifx_ERAY_MSIC3_Bits.MSIP93 */
#define IFX_ERAY_MSIC3_MSIP93_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_MSIC3_Bits.MSIP93 */
#define IFX_ERAY_MSIC3_MSIP93_OFF (29u)

/** \brief Length for Ifx_ERAY_MSIC3_Bits.MSIP94 */
#define IFX_ERAY_MSIC3_MSIP94_LEN (1u)

/** \brief Mask for Ifx_ERAY_MSIC3_Bits.MSIP94 */
#define IFX_ERAY_MSIC3_MSIP94_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_MSIC3_Bits.MSIP94 */
#define IFX_ERAY_MSIC3_MSIP94_OFF (30u)

/** \brief Length for Ifx_ERAY_MSIC3_Bits.MSIP95 */
#define IFX_ERAY_MSIC3_MSIP95_LEN (1u)

/** \brief Mask for Ifx_ERAY_MSIC3_Bits.MSIP95 */
#define IFX_ERAY_MSIC3_MSIP95_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_MSIC3_Bits.MSIP95 */
#define IFX_ERAY_MSIC3_MSIP95_OFF (31u)

/** \brief Length for Ifx_ERAY_MSIC4_Bits.MSIP96 */
#define IFX_ERAY_MSIC4_MSIP96_LEN (1u)

/** \brief Mask for Ifx_ERAY_MSIC4_Bits.MSIP96 */
#define IFX_ERAY_MSIC4_MSIP96_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_MSIC4_Bits.MSIP96 */
#define IFX_ERAY_MSIC4_MSIP96_OFF (0u)

/** \brief Length for Ifx_ERAY_MSIC4_Bits.MSIP97 */
#define IFX_ERAY_MSIC4_MSIP97_LEN (1u)

/** \brief Mask for Ifx_ERAY_MSIC4_Bits.MSIP97 */
#define IFX_ERAY_MSIC4_MSIP97_MSK (0x1u)

